12/data/attachments/4ccfc395a7e9f2a2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_fd25bb4d-253c-4c0f-9cdd-228e9f773737</nif:username>
            <nif:friendToBeAdded>Joseph_occur_Friend_24504_7</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>